<a href="https://colab.research.google.com/github/Diego-rp/Google-Colab/blob/master/05%20-%20Cleaning%20Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

---
# Lambda School Data Science - Intro to Pandas
---
# 05 - Cleaning Data
---

##STOP! BEFORE GOING ANY FURTHER...  


1. Click "File" at the top.
2. Then, "Save a Copy in Drive."
3. Change the file name to "FIRSTNAME_LASTNAME_1_2"  

Now you have a copy of this notebook in your Drive account. This is the copy you'll edit and submit. Be sure to do this for ***every*** assignment!

### Import pandas

In [0]:
import pandas as pd

### Import the data in the CSV file
You can find the data [here](https://raw.githubusercontent.com/axrd/datasets/master/gdpmessy2.csv). Should have a shape of (222,3). Use this [resource](https://www.iban.com/country-codes) to clean values correctly.

In [0]:
df = pd.read_csv('https://raw.githubusercontent.com/axrd/datasets/master/gdpmessy2.csv')

### Quickly inspect the head

In [20]:
df.head()

   Unnamed: 0        countrys     GDP code
0           0     Afghanistan   21.71  AFG
1           1         Albania   13.40  ALB
2           2         Algeria  227.80  DZA
3           3  American Samoa    0.75  ASM
4           4         Andorra    4.80  AND

### Inspect the tail

In [21]:
df.tail()

     Unnamed: 0             countrys    GDP code
217         217  U.S. Virgin Islands   5.08  VIR
218         218            West Bank   6.64  WBG
219         219                Yemen  45.45  YEM
220         220               Zambia  25.61  ZMB
221         221             Zimbabwe  13.74  ZMB

### What is the shape of the DataFrame? Does it correspond to what we expected?

In [22]:
df.shape

(222, 4)

### Do you need to change the index?

In [0]:
df.drop('Unnamed: 0', axis=1, inplace=True)

### Missing values?
Find all the missing values and correct them.

In [24]:
df.isnull().sum()

countrys    4
GDP         3
code        5
dtype: int64

In [25]:
df[df.isnull().any(axis=1)]

         countrys     GDP code
6             NaN    0.18  AIA
14   Bahamas, The    8.65  NaN
16     Bangladesh     NaN  BGD
20            NaN    1.67  BLZ
55        Denmark  347.20  NaN
70         France     NaN  FRA
90        Hungary  129.70  NaN
96        Ireland     NaN  IRL
100       Jamaica   13.92  NaN
106           NaN    0.16  KIR
200          Togo    4.84  NaN
206           NaN    0.04  TUV

### Find duplicate values  
Clean where necessary:  
*   France has a GDP of 2902.0 billion.
*   Ireland has a GDP of 245.80 billion.
*   Bangladesh has a GDP of 186.60 billion.

In [0]:
df.at[70, 'GDP'] = 2902
df.at[96, 'GDP'] = 245.8
df.at[16, 'GDP'] = 186.6

In [27]:
df["countrys"].value_counts(sort=True).head()

Maldives         1
Niue             1
El Salvador      1
Sudan            1
Cote d'Ivoire    1
Name: countrys, dtype: int64

In [28]:
df["code"].value_counts(sort=True).head()

ARG    2
ZMB    2
CRI    1
AUT    1
MCO    1
Name: code, dtype: int64

In [34]:
df[df['code']=='ARG']

    countrys    GDP code
8  Argentina  536.2  ARG

In [0]:
df.at[209, 'code'] = 'ARE'

In [37]:
df[df['code']=='ZMB']

    countrys    GDP code
220   Zambia  25.61  ZMB

In [0]:
df.at[221, 'code'] = 'ZWE'

### Verify the change persisted!

In [38]:
df[df.isnull().any(axis=1)]

         countrys     GDP code
6             NaN    0.18  AIA
14   Bahamas, The    8.65  NaN
20            NaN    1.67  BLZ
55        Denmark  347.20  NaN
90        Hungary  129.70  NaN
100       Jamaica   13.92  NaN
106           NaN    0.16  KIR
200          Togo    4.84  NaN
206           NaN    0.04  TUV

In [0]:
df.at[6, 'countrys'] = 'Anguilla'
df.at[14, 'code'] = 'BHS'
df.at[20, 'countrys'] = 'Belize'
df.at[55, 'code'] = 'DNK'
df.at[90, 'code'] = 'HUN'
df.at[100, 'code'] = 'JAM'
df.at[106, 'countrys'] = 'Kiribati'
df.at[200, 'code'] = 'TOG'
df.at[206, 'countrys'] = 'Tuvalu'

In [41]:
df[df.isnull().any(axis=1)]

Empty DataFrame
Columns: [countrys, GDP, code]
Index: []

### Submit your assignment notebook! (Make sure you've changed the name to FIRSTNAME_LASTNAME_1_2): 

1.  Click the Share button in the upper-right hand corner of the notebook.
2.  Get the shareable link.
3.  Set condition to: "Anyone with the link can comment."
4.  TBD 


---